<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Notes to Chappaz and Bovot</title>
</head>
<body>
<h2>Notes to Chappaz and Bovot</h2>

<a name="fn1">1 </a>J.-L. Bovot, `Informatisation des oushebtis dans les collections
&eacute;gyptiennes du Louvre', <i>Informatique et Egyptologie</i> 7 (janvier
1990), pp. 63-72.<p>
<a name="fn2">2 </a>J.-L. Chappaz, `R&eacute;pertoire Annuel des Figurines Fun&eacute;raires',
<i>BSEG</i> 11 (1987), pp. 141-51; 12 (1988), pp. 83-96; 14 (1990), pp. 89-104;
15 (1991), 115-27.<p>
<a name="fn3">3 </a>Ce projet b&eacute;n&eacute;ficie du soutien de la Soci&eacute;t&eacute; ibm
/France et de la Soci&eacute;t&eacute; d'Egyptologie, Gen&egrave;ve.<p>
<a name="fn4">4 </a>H. van den Berg-D. van der Plas, `A Key Issue for the Development of
Egyptological Databases. A Proposal for a System of Coherent Database Fields
for Use in Different Applications', <i>Informatique et Egyptologie</i> 7
(janvier 1990), pp. 152-6.<p>
<a name="fn5">5 </a>H. van den Berg-D. van der Plas, `cds /isis and the Development of an
Integrated Egyptological Database System', <i>Informatique et Egyptologie</i> 7
(janvier 1990), pp. 147-51.<p>
<a name="fn6">6 </a>Nous remercions bien sinc&egrave;rement le Prof. Dirk van der Plas et M. Hans
van den Berg, responsables de <i>Centre for Computer-aided Egyptological
Research</i> de l'Universit&eacute; d'Utrecht de l'int&eacute;r&ecirc;t qu'ils
ont constamment manifest&eacute; &agrave; notre projet et de l'aide
g&eacute;n&eacute;reuse qu'ils nous ont apport&eacute;e gr&acirc;ce &agrave;
leur ma&icirc;trise des probl&egrave;mes informatiques.<p>
<a name="fn7">7 </a>J.-L. Bovot-J.-L. Chappaz, `Base Internationale des Shaouabtis', <i>Actes du
Sixi&egrave;me Congr&egrave;s International</i> <i>d'Egyptologie de Turin</i>
(sous presse).<p>
<a name="fn8">8 </a>J.-L. Bovot-J.-L. Chappaz, <i>Base Internationale des Shaouabtis</i>
(Publications Interuniversitaires de Recherches Egyptologiques
Informatis&eacute;es, vol. V), Paris /Utrecht (&agrave; para&icirc;tre).<p>
<a name="fn9">9 </a>Le principe de la cr&eacute;ation d'un tel groupe de travail a
&eacute;t&eacute; d&eacute;cid&eacute; lors des rencontres tenues &agrave;
Cambridge en juillet 1992.<p>
<a name="fn10">10 </a>Le lecteur voudra bien excuser les auteurs de puiser la mati&egrave;re de ces
exp&eacute;riences dans leurs propres travaux. Ils n'ignorent pas que d'autres
&eacute;tudient avec brio les statuettes fun&eacute;raires. Mais il
&eacute;tait plus simple d'ex&eacute;cuter ces tests &agrave; l'aide d'objets
familiers, et d'&eacute;viter de faire subir un supplice informatique, dont les
r&eacute;sultats &eacute;taient encore incertains, aux recherches de leurs
coll&egrave;gues...<p>
<a name="fn11">11 </a>`sac sur &eacute;paule gauche--pilier dorsal--socle
trap&eacute;zo&iuml;dal--typologie Schneider: Cl.XIA6/W36 H4(?) I8 B28 Tp7a/P'
(<b>fig. 2.3</b>).
</body>
</html>