<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Chappaz and Bovot, BIS</title>
</head>
<body>
<h1>NOUVELLES DE LA BASE INTERNATIONALE DES SHAOUABTIS (BIS)</h1>

<h2>Jean-Luc Bovot, ParisJean-Luc Chappaz, Gen&egrave;ve</h2>

<p>La <b>Base Internationale des Shaouabtis</b> (<b>bis</b>) est n&eacute;e
  &agrave; Paris, en juillet 1990, lors des rencontres `Informatique et
  Egyptologie' organis&eacute;es par le Centre de Recherches
  &eacute;gyptologiques de l'Universit&eacute; de Paris-Sorbonne. Chacun des deux
  auteurs y avait pr&eacute;sent&eacute; ses travaux sur les figurines
  fun&eacute;raires entrepris &agrave; l'aide de l'outil informatique. Il s'agit
  d'une part de la banque de donn&eacute;es oushebti, application
  d&eacute;riv&eacute;e de la base pharaon du Mus&eacute;e du Louvre;<a href="Chappaz.notes.html#fn1">1</a> du<i>
  R&eacute;pertoire Annuel des Figurines Fun&eacute;raires</i>,<a href="Chappaz.notes.html#fn2">2</a> d'autre part.
  Chaque projet s'est d&eacute;velopp&eacute; dans un cadre diff&eacute;rent,
  avec ses propres contraintes. La banque de donn&eacute;es oushebtis, qui
  privil&eacute;gie les informations arch&eacute;ologiques et
  mus&eacute;ologiques, devait imp&eacute;rativement &ecirc;tre compatible avec
  les importants travaux men&eacute;s par l'&eacute;quipe des conservateurs du
  D&eacute;partement des antiquit&eacute;s &eacute;gyptiennes du Louvre. Le
  <i>R&eacute;pertoire</i> recense les r&eacute;f&eacute;rences bibliographiques
  et se pr&eacute;sente avant tout comme un <i>index</i> onomastique ou
  prosopographique. Ce n'est donc que dans un terme fort &eacute;loign&eacute;
  que ces deux bases auraient d&ucirc; se recouper. Sans abandonner pour autant
  leurs deux projets, parce que d&eacute;j&agrave; largement
  op&eacute;rationnels, les auteurs d&eacute;cid&egrave;rent de conduire une
  r&eacute;flexion commune pour tenter de d&eacute;finir une base commune
  sp&eacute;cifiquement consacr&eacute;e au type particulier du mat&eacute;riel
  &eacute;tudi&eacute;, loin des contraintes impos&eacute;es par les
  pr&eacute;c&eacute;dents projets: la <b>Base Internationale des Shaouabtis</b>
  (<b>bis</b>).<a href="Chappaz.notes.html#fn3">3</a></p>
<p><b>
  Principes directeurs</b></p>
<p>
Le ma&icirc;tre mot de la <b>Base Internationale des Shaouabtis</b> est la
<b>r&eacute;ciprocit&eacute;</b>. Un canevas de saisie (logiciel et exemples)
doit pouvoir &ecirc;tre remis &agrave; tous les chercheurs qui souhaiteraient
participer au projet. Une fois les fiches remplies selon les crit&egrave;res
d&eacute;finis, le chercheur fait parvenir une copie de son fichier &agrave;
l'un des trois centres internationaux de gestion de la base (Gen&egrave;ve,
Paris ou Utrecht) et les nouvelles fiches informatis&eacute;es sont alors
ins&eacute;r&eacute;es dans la base commune. En retour, le chercheur
re&ccedil;oit r&eacute;guli&egrave;rement les mises &agrave; jour du fichier
commun. A titre personnel, il peut utiliser librement les informations
contenues dans la base commune et citer les r&eacute;f&eacute;rences ou les
donn&eacute;es qu'il y trouverait, en mentionnant explicitement le nom de
l'auteur et le num&eacute;ro de la fiche d'o&ugrave; il tire ses
renseignements, comme s'il s'agissait d'une publication ordinaire. Il ne peut
pas en revanche diffuser ces informations ou le fichier &agrave; des tiers et
l'acc&egrave;s aux informations pour ceux qui ne contribuent pas au projet se
fera par l'interm&eacute;diaire d'un des trois centres internationaux. Un
projet de contrat qui garantira les droits intellectuels des collaborateurs de
la <b>Base Internationale des Shaouabtis</b> est actuellement en cours
l'&eacute;laboration.<p>
Pour atteindre ces objectifs, la base devait r&eacute;pondre &agrave; un
certain nombre de crit&egrave;res simples:<p>
1.	Fonctionner sur un logiciel internationalement reconnu, d'utilisation
ais&eacute;e, dont le co&ucirc;t ne puisse &ecirc;tre un obstacle &agrave; son
utilisation. Proposer si possible pour support de la base un logiciel qui
puisse &ecirc;tre mis gratuitement &agrave; disposition des chercheurs.<p>
2.	Pouvoir recueillir des donn&eacute;es dans les principales langues
habituellement utilis&eacute;es par les &eacute;gyptologues (anglais, allemand,
fran&ccedil;ais, arabe, italien, espagnol et ancien &eacute;gyptien...), sans
que la langue de saisie des informations ne devienne une g&ecirc;ne &agrave; la
recherche de celles-ci (<i>thesaurus</i> multilingue).<p>
3.	Etre si possible compatible avec les travaux entrepris par le groupe
`Informatique et Egypt-ologie' (<i>thesaurus</i>, fichier, codage
hi&eacute;roglyphique, etc.).<a href="Chappaz.notes.html#fn4">4</a><p>
4.	Admettre la saisie de plusieurs informations (trait&eacute;es
ind&eacute;pendamment) dans un seul et m&ecirc;me champ (`champ
r&eacute;p&eacute;titif'), de fa&ccedil;on &agrave; faire figurer &agrave;
l'indexation ou &agrave; la recherche, sur un m&ecirc;me plan, le nom ou le
surnom, le nom du p&egrave;re ou de la m&egrave;re, ou chacun des titres
port&eacute;s par un m&ecirc;me personnage par exemple.<p>
5.	Offrir aux chercheurs la possibilit&eacute; de transf&eacute;rer facilement
leurs propres donn&eacute;es pour les faire fonctionner sur un autre logiciel
(en vue d'une publication par exemple), et la possibilit&eacute; d'ajouter
&agrave; la base leurs propres champs pour des recherches
personnalis&eacute;es, ind&eacute;pendantes des d&eacute;finitions communes de
la base.
<p>
  Ces diff&eacute;rentes consid&eacute;rations nous ont conduit &agrave;
  d&eacute;velopper la base &agrave; l'aide du programme <b>cds /</b>isis,<a href="Chappaz.notes.html#fn5">5</a>
  con&ccedil;u par l'unesco et diffus&eacute; par cette institution ou par le
  Centre for Computer-aided Egyptological Research de l'Universit&eacute;
  d'Utrecht.<a href="Chappaz.notes.html#fn6">6</a></p>
<b><p>
Grille de saisie</b>
<p>Pour m&eacute;moire, la grille de saisie est pr&eacute;sent&eacute;e ici. Les
  diff&eacute;rents champs ont &eacute;t&eacute; comment&eacute;s lors du
  Sixi&egrave;me Congr&egrave;s International d'Egyptologie de Turin <a href="Chappaz.notes.html#fn7">7</a> et le
  seront en d&eacute;tail dans le manuel en pr&eacute;paration.<a href="Chappaz.notes.html#fn8">8</a></p>
<b><p>
Travaux r&eacute;cents sur la base</b><p>
Ces derniers mois ont &eacute;t&eacute; consacr&eacute;s &agrave; la mise au
point de la base, &agrave; la saisie d'exemples, &agrave; des essais de
fonctionnement et de recherches d'informations. Diff&eacute;rentes applications
concr&egrave;tes ont permis d'enrichir le <i>thesaurus</i> du vocabulaire
sp&eacute;cifiquement utilis&eacute; pour d&eacute;crire ou commenter les
statuettes fun&eacute;raires, et d'&ecirc;tre confront&eacute; &agrave;
certains probl&egrave;mes inh&eacute;rents aux textes anciens: comment rendre
compte des graphies abr&eacute;g&eacute;es ou superf&eacute;tatoires des noms
et titres sans perturber l'indexation de ces donn&eacute;es, pourtant
essentielles lors de la recherche d'informations? Sans rester confin&eacute; au
seul cas des figurines fun&eacute;raires, ce probl&egrave;me devrait faire
l'objet de r&eacute;flexions plus larges au sein de notre groupe.<a href="Chappaz.notes.html#fn9">9</a> Pour
l'heure, il a &eacute;t&eacute; convenu de s'en tenir strictement aux solutions
propos&eacute;es par les manuels de r&eacute;f&eacute;rences (<i>Wb.</i> et H.
Ranke, <i>Personennamen</i>) et H. van den Berg a bien voulu nous proposer un
programme qui permet de lever automatiquement toute ambigu&iuml;t&eacute; qui
r&eacute;sulte de l'ajout de diff&eacute;rents types de parenth&egrave;ses lors
de la translitt&eacute;ration et de retrouver les structures authentiques des
expressions &eacute;gyptiennes.<p>
Ces premiers tests ont &eacute;t&eacute; r&eacute;alis&eacute;s en supposant
que le titre &eacute;gyptien, le nom de l'individu ou celui de ses parents
&eacute;taient parfaitement connus et identifi&eacute;s par l'auteur de la
recherche. Ils ont prouv&eacute;s la fiabilit&eacute; de la base. En annexe, le
lecteur de ces lignes trouvera un exemple de son fonctionnement
g&eacute;n&eacute;ral dans ces conditions optimales (<b>Exemple 1: fig. 1, 2,
3</b>).<a href="Chappaz.notes.html#fn10">10</a><p>
Mais bien souvent, les figurines fun&eacute;raires sont inscrites tr&egrave;s
sommairement et il n'est pas rare que les textes en soient partiellement
effac&eacute;s; leur lecture est donc parfois difficile, voire
probl&eacute;matique. Dans ces cas, seuls quelques signes paraissent distincts,
et il devenait d&egrave;s lors n&eacute;cessaire de v&eacute;rifier si la
<b>Base Internationale des Shaouabtis</b> (<b>bis</b>) pouvait offrir une
r&eacute;ponse &agrave; cette r&eacute;alit&eacute; du mat&eacute;riel. Pour
l'exp&eacute;rience, il a &eacute;t&eacute; imagin&eacute; que seul un mot,
&eacute;l&eacute;ment constitutif d'un nom propre, avait pu &ecirc;tre
d&eacute;crypt&eacute;. En interrogeant la base sur ce seul
&eacute;l&eacute;ment identifi&eacute; (cha&icirc;ne de caract&egrave;res)
&agrave; travers un champ sp&eacute;cifique (en l'occurrence celui du `nom'),
sont apparues toutes les r&eacute;f&eacute;rences contenant cet
&eacute;l&eacute;ment, offrant donc au chercheur la possibilit&eacute;
d'examiner si certaines figurines enregistr&eacute;es dans la base
pr&eacute;sentent des parall&egrave;les &agrave; la statuette en cours
d'&eacute;tude. Cette technique est naturellement plus lente, puisque ces
&eacute;l&eacute;ments ne sont pas index&eacute;s et parce que, en
pr&eacute;sence du mat&eacute;riel ancien, il n'est pas toujours possible de
savoir si les quelques signes identifiables appartiennent au(x) titre(s), au
nom de l'individu ou &agrave; celui de ses parents (ce qui oblige &agrave;
recommencer l'interrogation &agrave; travers diff&eacute;rents champs). Les
r&eacute;sultats positifs de cette enqu&ecirc;te laisse cependant entrevoir les
riches possibilit&eacute;s d'identification du mat&eacute;riel qu'offrira bis
lorsque la base contiendra suffisamment de r&eacute;f&eacute;rences.<p>
Lors de ces derni&egrave;res exp&eacute;riences, le programme cds<b> /</b>isis
r&eacute;serva alors une excellente surprise. Equip&eacute; d'un `compteur', il
fournit avec la r&eacute;ponse le nombre et le pourcentage d'occurrences de
l'&eacute;l&eacute;ment recherch&eacute;. En d'autres termes, la base offre la
possibilit&eacute; d'&eacute;tudes statistiques du mat&eacute;riel ou de faits
de civilisation: fr&eacute;quence d'un titre, d'un nom, de la pr&eacute;sence
d'une divinit&eacute; dans les noms th&eacute;ophores, etc. Le second exemple
pr&eacute;sent&eacute; <i>infra</i> illustre cette possibilit&eacute; du
logiciel (<b>Exemple 2: fig. 4</b>).<p>
Au terme de cette rapide pr&eacute;sentation, il convient d'ajouter que les
auteurs travaillent encore actuellement &agrave; la r&eacute;daction du `manuel
de saisie' qui devra guider les coll&egrave;gues int&eacute;ress&eacute;s par
ce projet, mais que la base est d'ores et d&eacute;j&agrave; disponible
&agrave; tous ceux qui voudraient la tester.<b><p>

<img src="shabti.gif">

Exemple 1</b><p>
Oushebti du proph&egrave;te et scribe royal Th&eacute;&ocirc;s, fils de
Ouadjet.<p>
Mus&eacute;e d'art et d'histoire, Gen&egrave;ve (inv.: D 284).<p><b>
Fig. 1:</b> 	photographie<p>
		(clich&eacute; Y. Siza, Mus&eacute;e d'art et d'histoire,
Gen&egrave;ve).<p><b>
Fig. 2: </b>	bordereau de saisie (copies de l'&eacute;cran).<p>
		A noter que le champ typologie (<b>fig. 2.2</b>) est apparemment trop court
pour recueillir toutes les informations. En r&eacute;alit&eacute;, il s'agit
d'un `champ d&eacute;roulant', c'est-&agrave;-dire que, parvenu en bout de
ligne, le texte d&eacute;j&agrave; saisi se d&eacute;place sur la gauche et
laisse de nouvelles lignes libres pour inscrire la suite (<b>fig. 2.3</b>).11
La totalit&eacute; du texte est inscrite dans la m&eacute;moire de
l'ordinateur, comme le prouve l'impression de l'affichage du r&eacute;sultat
d'une recherche apr&egrave;s interrogation (<b>fig. 3</b>).<p>
		On rel&egrave;vera &eacute;galement le champ titre (<b>fig. 2.2)</b>, qui est
un `champ r&eacute;p&eacute;titif': les deux titres du personnage (Hm-nTr et
sS-nsw.t) sont inscrits c&ocirc;te-&agrave;-c&ocirc;te, s&eacute;par&eacute;s
par un trait vertical (touche F9). A l'interrogation (<b>fig. 3</b>), la fiche
est retrouv&eacute;e que l'on recherche un Hm-nTr, un sS-nsw.t ou un personnage
qui soit &agrave; la fois Hm-nTr et sS-nsw.t (commande: Hm-nTr*sS-nsw.t).<p><b>
Fig. 3:</b>	 Affichage des r&eacute;sultats d'une recherche.<p>
		Gr&acirc;ce au choix des indexations, la fiche est retrouv&eacute;e
rapidement et automatiquement avec l'une des commandes suivantes:<tt><p>
Dd-Hr				Hm-nTr*Dd-Hr<p>
Hm-nTr				sS-nsw.t*Dd-Hr<p>
sS-nsw.t				Dd-Hr*wAD.t<p>
wAD.t				Hm-nTr*sS-nsw.t*Dd-Hr<p>
Hm-Ntr*sS-nsw.t 		etc.</tt><p>
mais aussi &agrave; l'aide de commandes suivies d'une `troncature':<tt><p>
Dd-H$				Hm$<p>
Dd-$					sS$<p>
Dd$					wA$<p>
D$					etc.</tt><p>
Dans tous ces cas, l'`affichage de la recherche' propose le m&ecirc;me
r&eacute;sultat, reproduit en <b>fig. 3</b>.<p>
Il demeure &eacute;vident que plus l'&eacute;quation de recherche sera
pr&eacute;cise et plus la probabilit&eacute; de limiter le nombre de
r&eacute;ponse possible sera importante. Interroger la base sur une seule
lettre, suivie d'une troncature (par exemple: D$), fera appara&icirc;tre tous
les titres et noms des propri&eacute;taires de figurines fun&eacute;raires,
ainsi que ceux de leurs parents, commen&ccedil;ant par cette `lettre' D (=
&Iacute; ou &Icirc; selon le syst&egrave;me de codage).<p>
<p>
Exemple 1, figure 1:<p>
Oushebti du proph&egrave;te et scribe royal Th&eacute;&ocirc;s, fils de
Ouadjet<p>
Mus&eacute;e d'art et d'histoire, Gen&egrave;ve (inv.: D 284)<p>
(clich&eacute; Y. Siza, Mus&eacute;e d'art et d'histoire, Gen&egrave;ve)<p>
<p>
Exemple 1, figure 2:<p>
Fig. 2.1: bordereau de saisie, p. 1 (copie de l'&eacute;cran)<p>
Fig. 2.2: bordereau de saisie, p. 2 (copie de l'&eacute;cran)<p>
Fig. 2.3: bordereau de saisie, p. 2 (d&eacute;tail du champ
d&eacute;roulant).<p>
<p>
Exemple 1, figure 2:<p>
Fig. 2.4: bordereau de saisie, p. 3 (copie de l'&eacute;cran)<p>
Fig. 2.5: bordereau de saisie, p. 4 (copie de l'&eacute;cran)<p>
<p>
Exemple 1, figure 3:<p>
Affichage d'une recherche portant sur tout &eacute;l&eacute;ment de la fiche
000006<p>
<p>
Exemple 2, figure 4:<p>
L'interrogation porte sur la cha&icirc;ne de caract&egrave;res Hr (Horus),
&agrave; travers le champ `nom'. En d'autres termes, toutes les occurrences du
nom de ce dieu dans les noms th&eacute;ophores sont recherch&eacute;es.<p>
La r&eacute;ponse indique que sur six fiches examin&eacute;es (pour les besoins
de l'exp&eacute;rience, la base a &eacute;t&eacute; r&eacute;duite &agrave; un
minimum de fiches), le nom du dieu Horus appara&icirc;t deux fois dans la
composition d'un anthroponyme, soit 33.33% du total.<p>
A la commande d'affichage de cette recherche, le programme propose les deux
fiches retrouv&eacute;es, sous une forme semblable &agrave; la <b>fig. 3</b>,
&agrave; laquelle le lecteur voudra bien se reporter.<p>
<p>
</p>
</body>

</html>