<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
</head>
<body>

<h3>Steinborn notes</h3>

<a name="fn1">[1]</a>Eine Erweiterung ist im Rahmen des rama-Projektes geplant.<p><b>

<a name="fn2">[2]</a>L</b>ocal <b>A</b>rea <b>N</b>etwork. Im Gegensatz zu <b>W</b>ide <b>A</b>rea
<b>N</b>etwork (wan) kann ein lan nicht &uuml;ber gr&ouml;&szlig;ere
Entfernungen verlegt werden, die Grenze liegt bei etwa 2000 Metern.<p>

<a name="fn3">[3]</a>Es ist des Weiteren durchaus damit zu rechnen, da&szlig; man in der einen oder
anderen Institutionen ein lan einrichten wird. Dieses lan w&uuml;rde dann im
Netz mit anderen pc oder sogar einem lan kommunizieren.<p>

<a name="fn4">[4]</a>E. W. Adams, N. Strudwick 1990 sowie Loring 1990.<p>

<a name="fn5">[5]</a>Der Hauptunterschied zwischen Netzwerkdatenbanken und relationalen Datenbanken
besteht darin, da&szlig; sich die Relationen zwischen den Entit&auml;ten nicht
einfach aus der Vergabe von Prim&auml;r-und Fremdschl&uuml;sseln auf bestimmte
Tabellen bzw. Tabellenfeldern ergeben, sondern sich erst durch die
Verkn&uuml;pfung mehrerer verteilter Tabellen ergeben. Die Abh&auml;ngigkeit
liegt nicht im Schl&uuml;ssel sondern in der Verbindung der Tabellen
untereinander.<p>

<a name="fn6">[6]</a>Der Punkt in Mehrproze&szlig;systemen, wo sich gleichzeitig arbeitende Nutzer
dadurch behindern, da&szlig; sie vom System bestimmte Aktionen anfordern, die
andere Prozesse einfrieren. Bei ung&uuml;nstigen Konstellationen kann es zum
Systemstillstand kommen.<p>

<a name="fn7">[7]</a>Einen gro&szlig;en Fortschritt erreichte ich dadurch, da&szlig; ich auf die
bereits geleistete Arbeit von Herrn Matzker zur&uuml;ckgreifen konnte, der in
den vergangenen Jahren den gr&ouml;&szlig;ten Teil der westlichen
Sammlungsbest&auml;nde mit dBase iii+ bzw. dBase iv aufgenommen hat. Eine
&Uuml;bernahme der Daten war &uuml;ber das ascii delimited Format ohne weiteres
m&ouml;glich. Das Modell und die Definition der Berliner Datenbank befindet
sich auch an der Staatlichen Sammlung &Auml;gyptische Kunst in M&uuml;nchen im
Einsatz.<p>

<a name="fn8">[8]</a>Auch hier beachte man das Problem der Konsistenz der Datenbank: ist
gew&auml;hrleistet, da&szlig; sich zu einem bestimmten Zeitpunkt auf allen
Rechnern dieselben Daten befinden?<p>

<a name="fn9">[9]</a>Es gibt inzwischen auch Mischformen von Leitungsverbindungen, die
haupts&auml;chlich durch Software generiert werden, so z.B. sogenannte
`semipermanente Verbindungen' etc.<p>

<a name="fn10">[10]</a>Hinter diesem Ausdruck verbirgt sich nichts als die Art und Weise, wie hier
die Daten &uuml;bertragen werden. In einem Token-Ring versieht sich jeder
Rechner beim Einschalten mit einer Adresse und meldet sich im Netz an. Von nun
an ist er ein Teil des Netzes und erkennt automatisch im Datenstrom diejenigen
Daten, die `f&uuml;r ihn' sind an der Adresse, die ein jeder Datenstrom in
einem Header mit sich f&uuml;hrt. Der kleinste Token-Ring besteht aus einem
Rechner, eine Teilnehmerbegrenzung gibt es praktisch nicht. <p>

<a name="fn11">[11]</a>Auch &uuml;ber die Aufstellung von pcs innerhalb der Ausstellungsr&auml;ume
des Museums, wie sie bereits in einigen amerikanischen und d&auml;nischen
Museen realisiert wurden (so zum Beispiel im Museum of Fine Arts Pittsburgh,
Pennsylvania und im Nationalmuseum von Kopenhagen) mu&szlig; nachgedacht
werden, da diese die Attraktivit&auml;t der Sammlungen betr&auml;chtlich
erh&ouml;hen. Datenschutzprobleme gibt es hier nicht, da die Zugriffsrechte
sehr beschr&auml;nkt verteilt und auch jederzeit wieder entzogen werden
k&ouml;nnen. <p>
</body>
</html>
