<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd"><html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Les Artistes de Pharaon</title>	</head>	<body bgcolor="white">		<br>		<br>		<br>		Les Artistes de Pharaon. Deir-el-M&eacute;dineh et la Vall&eacute;e des Rois. 300 p., 220 x 280 mm, 2002, Paperback, ISBN 2-503-51402-2, ? 39.00 hors taxe<br>		Le village de Deir el-M&eacute;dineh, en Haute-Egypte, est moins connu que les sites prestigieux de Karnak ou de Louqsor. C'est pourtant l&agrave;, au Nouvel Empire (1500-1100 avant J.-C.), que v&eacute;curent ceux qui &eacute;taient charg&eacute;s de creuser et de d&eacute;corer les tombes de la Vall&eacute;e des Rois et de la Vall&eacute;e des Reines, situ&eacute;es &agrave; quelques kilom&egrave;tres, aujourd'hui fameuses pour la beaut&eacute; des peintures et des bas-reliefs qui les ornent. En d&eacute;couvrant Deir el-M&eacute;dineh nous p&eacute;n&eacute;trons - fait exceptionnel dans notre connaissance de l'Egypte ancienne - dans la vie quotidienne de ces foyers qui vivaient dans la familiarit&eacute; du beau et du divin, tout en menant une existence ordinaire. Chaises, paniers, vaisselle, objets de culte, dessins, lettres, po&egrave;mes &eacute;voquent leurs journ&eacute;es laborieuses, leurs loisirs, leur vie spirituelle mais surtout l'inventivit&eacute;, la ma&icirc;trise stylistique de ces artistes-artisans, et leur humour&#133; L'exposition pr&eacute;sent&eacute;e au mus&eacute;e du Louvre - qui rejoindra ensuite Bruxelles puis Turin - rend hommage &agrave; cette communaut&eacute; gr&acirc;ce &agrave; laquelle on peut d&eacute;sormais appr&eacute;hender de mani&egrave;re tr&egrave;s nouvelle l'&eacute;laboration des chefs-d'&#156;uvre de l'art &eacute;gyptien, et dont les usages, trois mille ans plus tard, nous paraissent d'autant plus &eacute;mouvants qu'ils ressemblent aux n&ocirc;tres.<br>		<br>		<br>		<br>		<br>		De kunstenaars van de Farao's. Deir el-Medina en de Vallei der Koningen. 300 p., 220 x 280 mm, 2002, Paperback, ISBN 90-5622-044-6, ? 39 excl. BTW<br>		Het dorp Deir el-Medina in Boven-Egypte is niet zo bekend als de imposante sites Karnak en Luxor. Nochtans leefden daar, tijdens het Nieuwe Rijk (1500-1100 v.Chr.), diegenen die belast waren met het uithakken en decoreren van de tombes in de Vallei der Koningen en de Vallei der Koninginnen. Deze koninklijke graven, die zich op enkele kilometer afstand van het dorp bevinden, zijn terecht beroemd voor de schoonheid van hun wandschilderingen en reli&euml;fvoorstellingen. Een verkenning van Deir el-Medina laat ons toe door te dringen in het leven van alledag. We maken kennis met families die vertrouwd waren met al het sublieme en goddelijke van Egypte, maar tegelijk ook een eenvoudig bestaan kenden. Stoelen, manden, vaatwerk, cultusvoorwerpen, tekeningen, brieven en gedichten evoceren het labeur, de vermakelijkheden, het geestelijk leven, maar vooral ook de inventiviteit, het artistieke meesterschap en het gevoel voor humor van deze kunstenaars-ambachtlui. De tentoonstelling in het Louvre, die vervolgens naar Brussel reist en dan Turijn aandoet, brengt hulde aan deze dorpsgemeenschap. Deir el-Medina's nalatenschap stelt ons in staat op een originele manier het productieproces van Oud-Egyptische meesterwerken te bekijken. Nu, drieduizend jaar later, maken wij intiem kennis met de bewoners van het dorp. Hun gewoonten en gebruiken waren niet eens zo verschillend van de onze&#133; en dat maakt deze ontmoeting tot een aangrijpende belevenis.<br>		BON DE COMMANDE<br>		BESTELBON<br>		<br>		<br>		<br>			Oui, Je d&eacute;sire commander un exemplaire de Les Artistes de Pharaon. Deir-el-M&eacute;dineh et la Vall&eacute;e des Rois. ISBN 2-503-51402-2, ? 39.00 hors taxe<br>		<br>			Ja, ik wens een exemplaar van De kunstenaars van de Farao's. Deir el-Medina en de Vallei der Koningen te bestellen.<br>		ISBN 90-5622-044-6, ? 39.00 excl. BTW<br>		<br>		Nom/Naam:<br>		<br>		&#133;.<br>		<br>		(nummer toevoegen: 84PD0228)<br>	</body></html>