<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd"><html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>May 2000</title>		<!-- This document was created from RTF source by rtftohtml version2.7.5 -->	</head>	<body bgcolor="white">		<h1>Wilbour acquisitions, May 2000</h1>		<p>Abusch, Tzvi and Karel van der Toorn. Mesopotamian magic: Textual, historical, and interprative prespectives (Studies in ancient magic and divination 1) ISBN 90 5693 033 8. Groningen: Styx Publications, 1999.</p>		<p>Adamson, Stanley L. Old nursery rhymes dug up at the pyramids. London: Dean &amp; Son, 19??.</p>		<p>American Research Center in Egypt = ARCE. Fifth-first annual meeting, Berkeley, CA, April 28-30, 2000: Programs and abstracts. 2000.</p>		<p>Baas, P. [Review of] Vartavan, Christian and Victoria Aseni Amoros. Codex of ancient Egyptian plant remains = Codex des restes v&eacute;g&eacute;taux de l'Egypte ancienne. IN: Iawa journal 20, no. 2 (1999), p. 114. 1999.</p>		<p>Ballet, Pascale. La vie quotidienne &agrave; Alexandrie 331-30 avant J.-C. ISBN 2012353499 (La vie quotidienne) Paris: Hachette, 1999.</p>		<p>Barbotin, Christophe et Christian Leblanc. Les monuments d'&eacute;ternit&eacute; de Rams&egrave;s II: Nouvelles fouilles th&eacute;baines (Exposition-dossier du D&eacute;partement des Antiquit&eacute;s &eacute;gyptiennes 56) ISBN 2 7118 3831 5. Paris: R&eacute;union des Mus&eacute;es Nationaux, 1999.</p>		<p>Barbotin, Christophe. Catalogue raisonn&eacute; de la collection d'Antiquit&eacute;s &eacute;gyptiennes conserv&eacute;e au mus&eacute;e Granet (Aix-en-Province) ISBN 2-902410-05-0. Aix-en-Provence: 1995.</p>		<p>Bellinger, Louisa. Textile analysis: Early techniques in Egypt and the Near East. IN: Textile Museum workshop notes, paper no. 2 (June 1950) p. ?. Washington, D.C.: Textile Museum, 1950.</p>		<p>Berlev, O.D. The methods of expressing filiation in the Middle Egyptian texts. IN: Palestinskii Sbornik 79, no. 2 (1962) p. 13-42. 1962.</p>		<p>Bianchi, Robert Steven. Alexander the Great and the city of Alexandria. IN: The world of the Bible 2 (Nov-Dec 1999) p. 4-19. ASOR, 1999.</p>		<p>Bianchi, Robert Steven. Egipte mil-lenari: Vida quotidiana en l'&egrave;poca dels faraons. ISBN 84 7664 601 1. Barcelona: Fundaci&oacute; &quot;la Caixa&quot;, 1998.</p>		<p>Bianchi, Robert Steven. Letters: Melikian and antiquities. IN: Art &amp; Auction (Nov 1, 1999) p. 36. 1999.</p>		<p>Bietak, Manfred, ed. Die Beziehungen zwischen &Auml;gypten und der Minoischen Welt. ISBN 3700125720 (&Auml;gypten und Levante 6) Wien: Verlag der &Ouml;sterreichischen Akademie der Wissenschaften, 1996.</p>		<p>Bietak, Manfred. Der &Uuml;bergang von der Fr&uuml;hen zur Mittleren Bronzezeitkultur im Vorderen Orient anhand von Wandbildern in Gr&auml;bern des &auml;gyptischen Mittleren Reiches. IN: Mitteilungen der Anthropologischen Gesellschaft in Wien 123/124 (1993/1994) p. 391-399. Wien: 1994.</p>		<p>Boardman, John. Escarabeos de piedra procedentes de Ibiza (Museo arqueologico nacional, Cat&aacute;logos y monograf&iacute;as 8) ISBN 84 505 1235 2. Madrid: Museo arqueologico nacional, 1985.</p>		<p>Bohac, Ken. The Egyptian galleries at the Cleveland Museum. IN: Minerva 11, no. 2 (Mar-Apr 2000) p. 20-25. 2000.</p>		<p>Brissaud, Philippe et Christiane Zivie-Coche. Tanis: Travaux r&eacute;cents sur le Tell S&acirc;n el-Hagar: Mission fran&ccedil;aise des fouilles de Tanis 1987-1997. ISBN 2 911606 05 1. Paris: &Eacute;dition No&ecirc;sis, 1998.</p>		<p>Daglio, Cristiano. La medicina dei faraoni. ISBN 88 86626 36 3. Torino: Ananke, 1998.</p>		<p>Donadoni, Sergio. Tebe, Centri e monumenti dell'antichit&agrave;. ISBN 8843562096. Milano: Electa, 1999.</p>		<p>Drevnii Egipet = Ancient Egypt: Language-Culture-Consciousness. ISBN 5 85324 061 7. Moscow: 1999.</p>		<p>Eisenberg, Jerome M. Ancient faces: Mummy portraits at the Metropolitan. IN: Minerva 11, no. 2 (Mar-Apr 2000) p. 32-33. 2000.</p>		<p>Eisenberg, Jerome M. The Christos G. Bastis antiquities collection. IN: Minerva 11, no. 2 (Mar-Apr 2000) p. 34-38. 2000.</p>		<p>Eisenberg, Jerome M. and Naglaa Habib El Zahlawi. News from Egypt. IN: Minerva 11, no. 2 (Mar-Apr 2000) p. 6. 2000.</p>		<p>Emerson, Ellen Russell. IN ARL The Book of the Dead and rain ceremonials. IN: The American anthropologist 7, no. 3 (Jul 1894) p. 233-259. 1894.</p>		<p>Flores, Diane Victoria. The funerary sacrifice of animals during the predynastic period. Dissertation -- University of Toronto, 1999. 1999.</p>		<p>Freeman, Charles. Egypt, Greece and Rome: Civilizations of the ancient Mediterranean. ISBN 0198721943. Oxford U.P., 1996.</p>		<p>Gould, Stephen Jay. The mismeasure of man / by Stephen Jay Gould. -- Rev. and expanded. ISBN 0-393-03972-2. New York : Norton, c1996.</p>		<p>Hecht, Robert E., Jr. [dealer] [Ancient art catalog] 2000.</p>		<p>Hill, Marsha. Ancient Egyptian royal bronzes, with special attention to the kneeling pose. Dissertation -- NYU, 2000. 2000.</p>		<p>Hoffmeier, James K. Egyptians. IN: Hoerth, A.J. Peoples of the Old Testament world, p. 251-292. Grand Rapids: Baker Books, 1994.</p>		<p>Honolulu Academy of Arts. Mystery of the Nile: Treasures from Ancient Egypt. IN: Honolulu Academy of Arts Calendar News 72, no. 3 (May-Jun 2000) p. 2-5. 2000.</p>		<p>Huddlestun, John R. &quot;Who is this that rises like the Nile?&quot;: Some Egyptian texts on the inundation and a prophetic trope. IN: Fortunate the eyes that see: Essays in honor of David Noel Freedman in celebration of his seventieth birthday, p. 338-363. Grand Rapids, MI: Eerdmans, 1995.</p>		<p>International congress of Egyptologists (8th : Cairo : 28 Mar - 3 Apr 2000) Late Abstracts. Cairo: 2000.</p>		<p>Jacob, Christian et Fran&ccedil;ois de Polignac. Alexandrie IIIe si&egrave;cle avant J.-C.: Tous les savoirs du monde ou le r&ecirc;ve d'universalit&eacute; des Prol&eacute;m&eacute;es (S&eacute;rie m&eacute;moires 19) ISBN 2 86260 391 0. Paris: &Eacute;ditions Autrement, 1992.</p>		<p>Larson, John. Science comes to the aid of the conservator. IN: Minerva 11, no. 2 (Mar-Apr 2000) p. 16-19. 2000.</p>		<p>Legon, John. Wooden measuring rods. IN: EEF (26 Apr 2000, 12:01:16) 2000.</p>		<p>Lyster, William. Monastery of St. Paul. ARCE, 1999.</p>		<p>Macaulay, David. Motel of the mysteries. ISBN 0 395 28425 2. Boston: Houghton Mifflin, 1979.</p>		<p>Mansoor, Edmond R. [Draft of a letter to Dr. Richard Fazzini, President of ARCE email sent 21 Apr 2000 19:11:15] 2000.</p>		<p>Maravelia, Amanda-Alice: Ta erotika poiemata tes archaias Aigyptou. ISBN 960-527-014-5 = The love poems of ancient Egypt. Athens: 1996; 2nd edn. Athens 2001.</p>		<p>Marconot, Jean-Marie and Sydney H. Aufr&egrave;re. L'interdit et le sacr&eacute; dans les religions de la Bible et de l'&Eacute;gypte: Actes du colloque Montpellier, le 20 mars 1998. ISBN 2 84269 266 7. Montpellier: Universit&eacute; Paul-Val&eacute;ry, 1998.</p>		<p>Meinardus, Otto F.A. Two thousand years of Coptic Christianity. ISBN 977-424-511-3. Cairo: American University in Cairo Press,1999.</p>		<p>Melikian, Souren. The majestic and mysterious review of Egyptian Art in the Age of the Pyramids]. IN: International Herald Tribune (9-25-1999) 1999.</p>		<p>Meltzer, Edmund S. Return of the mummy. IN: Discover (May 2000) p. 12-13. 2000.</p>		<p>Morkot, Robert G. The black pharaohs: Egypt's Nubian rulers. ISBN 0 948695 23 4. London: Rubicon, 2000.</p>		<p>M&uuml;ller, Hans Wolfgang and Eberhard Thiem. Gold of the pharaohs. ISBN 0 8014 3725 3. Cornell University Press, 1999.</p>		<p>Museo di antichit&agrave; (Turin, Italy) Regio museo di Torino [microfiche] / ordinato e descritto da A. Fabretti, F. Rossi e R.V. Lanzone. Torino: Stamperia reale della ditta G.B. Paravia, 1881-1888.</p>		<p>Obenga, Th&eacute;ophile. Cheikh Anta Diop, Volney et le Sphinx: Contribution de Cheikh Anta Diop &agrave; l'Historiographie mondiale. ISBN 2 909885 04 6. Gif-sur-Yvette: Khepera, 1996.</p>		<p>Obenga, Th&eacute;ophile. La philosophie africaine de la p&eacute;riode pharaonique 2780-330 avant notre &egrave;re. ISBN 2 7384 0502 9. Paris: L'Harmattan, 1990.</p>		<p>Parlett, Graham. A ceramic W3s sceptre in the V&amp;A. IN: Friends of The Petrie Museum Newsletter 16 (Summer 1997) p. 1-2. 1997.</p>		<p>Rasch, Bernhard. Prospektion con arch&auml;ologischen St&auml;tten in &Auml;gypten unter Verwendung naturwissenschaftlicher Applokationen: Eine historische und praktische Darstellung (Beitr&auml;ge zur &Auml;gyptologie 17) (Ver&ouml;ffentlichungen der Institute f&uuml;r Afrikanistik und &Auml;gyptologie der Universit&auml;t Wien 87) ISBN 3-85043-087-1. Wien: Afro-Pub, 2000.</p>		<p>Ray, J.D. Egyptian wisdom literature. IN: Wisdom in ancient Israel: Essays in honour of J.A. Emerton, p. 17-29. Cambridge U.P., 1996.</p>		<p>Rocchi, Federico. A personal report on 8th ICE (Part 2). IN: EEF (4-30-2000) 2000.</p>		<p>Rocchi, Federico. [Review of] Donadoni, Sergio. Tebe, Centri e monumenti dell'Antichit&agrave;. Milano: Electa, 1999. IN: EEF (29 Apr 2000 17:33:56) 2000.</p>		<p>Sall, Babacar. Racines &eacute;thiopoennes de l'&Eacute;gypte ancienne. ISBN 2 909885 07 0. Gif-sur-Yvette: Khepera, 1999.</p>		<p>Scott, Kenneth. The political propaganda of 44-30 B.C. IN: American academy in Rome memoirs 11 (1933) p. 7-49. 1933.</p>		<p>Shephard, Esther. Possible sources of some of Whitman's ideas and symbols in Hermes Mercurius Trismegistus and other works. IN: Modern Language Quarterly 14 (1953) p. 60-81. Seattle, WA: University of Washington, 1953.</p>		<p>Spieser, Cathie. Les noms du Pharaon &ecirc;ntre autonomes au Nouvel Empire (OBO 174) ISBN 3-7278-1282-6. Freiburg: Universit&auml;tsverlag, 2000.</p>		<p>Tak&aacute;cs, G&aacute;bor. Etymological dictionary of Egyptian 1: A Phonological introduction. ISBN 90 04 11538 2 (Handbook of Oriental Studies 1: Ancient Near East 48) Leiden: Brill, 1999.</p>		<p>The Assyrian dictionary of the Oriental Institute of the University of Chicago 14 (1999) R. ISBN 0 918986 05 2. Chicago: Oriental Institute, 1999.</p>		<p>Uphill, Eric P. Pharaoh's gateway to eternity: The Hawara labyrinth (Studies in Egyptology) ISBN 0-7103-0627-X. London: KPI, 2000.</p>		<p>Vergnieux, Robert. Recherches sur les monuments th&eacute;bains d'Amenophis IV &agrave; l'aide d'outils informatiques: Methodes et r&eacute;sultats (Cahiers de la Soci&eacute;t&eacute; d'Egyptologie 4) ISBN 2 940011 05 2. Geneva: 1999.</p>		<p>Waltke, Bruce K. The Book of Proverbs and ancient wisdom literature. IN: Learning from the sages: Selected studies on the Book of Proverbs, p. 49-65. Grand Rapids, MI: Baker Books, 1995.</p>		<p>Whitman, Walt. IN: Life illustrated (Dec 8, 1855) [about his looking at the Rosellini book in the Astor Library]. IN: New York Dissected 1936 ed. [published by Rufus Rockwell Wilson] p. 30-40. 1855.	</body></html>