<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd"><HTML><HEAD>   <TITLE>Author</TITLE><!-- This document was created from RTF source by rtftohtml version2.7.5 --></HEAD><BODY BGCOLOR="#FFFFFF"><H1>Wilbour Library Acquisitions</H1><H2>March 1998</H2><P>Adams, Barbara and Krzystof Cialowicz Protodynastic Egypt (ShireEgyptology 25) ISBN 0 7478 0357 9. Shire, 1997.</P><P>Barrig&oacute;n Fuentes, Carmen Les dieux &eacute;gyptiens dansl'Onirocriticon d'Art&eacute;midore. IN: Kernos 7 (1994) p. 29-45.Athens - Li&egrave;ge: Centre d'&eacute;tude de la religion grecqueantique, 1994.</P><P>Basch, Lusien Navires et bateaux coptes: &eacute;tat des questionsen 1991. IN: Graeco-Arabica 5 (1993) p. 23-62. Athens: Associationfor Greek and Arabic Studies, 1993.</P><P>Bianchi, Robert S. Every day life of the elite in ancient Egypt: ATravelling exhibition in Spain from Germany. IN: Minerva 9, no. 2(Mar/Apr 1998) p. 35ff. 1998.</P><P>Bianchi, Robert Steven &#91;Review of&#93; Matheson, Susan B.Polygnotos and vase painting in classical Athens (Wisconsin studiesin classics) Madison: University of Wisconsin Press, 1995. IN:Religious studies review 24, no. 1 (Jan 1998) p. 71. 1998.</P><P>Blumenthal, Elke Vom Wesen der alt&auml;gyptischen Religion. IN:Theologische Literautrzeitung 117 (1992) p. 889-896. Leipzig:1992.</P><P>Brier, Bob The encyclopedia of mummies. ISBN 0-8160-3108-8. NY:Facts on File, 1998.</P><P>Campbell, Donald Wayfarings among the pharaohs. Adelaide: W.K.Thomas, 1923.</P><P>Chandler, Tertius Dating Moses's Exodus. IN: Bibbia e Oriente 35,no. 2 (Apr-May-Jun 1993) p. 88. Brescia: Centro Studi e ArteGrafiche, 1993.</P><P>Christiansen, H. Dalgas Decanal star tables for lunar houses inEgypt? IN: Centaurus 35 (1992) p. 1-27 (fig.) Copenhagen: Munksgaard,1992.</P><P>Damiano-Appia, Maurizio Egitto e Nubia (Guide archeologicheMondadori) ISBN 88-04-39704-7. Milano: Mondadori, 1995.</P><P>Davies, Vivian and Ren&eacute;e Friedman Egypt uncovered. ISBN1-55670-818-1. New York: Stewart, Tabori &amp; Chang, 1998.</P><P>Depla, Annette Women in ancient Egyptian wisdom literature: IN:Archer, L&eacute;onie et al. eds. Women in ancient societies: Anillusion of the night, p. 23-52. Basingstoke: The Macmillan Press,1994.</P><P>Diez de Velasco, Francisco and Miguel Angel Molinero PoloHellenoaegyptiaca I: Influences &eacute;gyptiennes dans l'imaginairegrec de la mort: quelque exemples d'un emprunt suppos&eacute;(Diodore, I, 92, 1-4; I, 96. 4-8). IN: Kernos 7 (1994) p. 75-93.Athens, Li&egrave;ge: 1994.</P><P>Dils, Peter On several cartouches supposeely of C. Iulius CaesarGermanicus. IN: Zeitschrift f&uuml;r Papyrologie und Epigraphik 100(1994) p. 347-350. Bonn: Habelt Verlag, 1994.</P><P>Doig, Kenneth F. The 1552 Exodus. IN: Catastrophism and ancienthistory 12, no. 2 (July 1990) p. 147-158. Los Angeles: Catastrophismand ancient history, 1990.</P><P>D'un Orient l'autre: les m&eacute;tamorphoses successives desperceptions et connaissances. ISBN 2222045029. Paris: CNRS, 1991.</P><P>Eisenberg, Jerome M. News from Egypt. IN: Minerva 9, no. 2(Mar/Apr 1998) p. 2-3. 1998.</P><P>Eisenberg, Jerome M. The winter 1997 antiquities sales. IN:Minerva 9, no. 2 (Mar/Apr 1998) p. 30ff. 1998.</P><P>Erman &Auml;gyptische Abteilung. IN: Jahrbuch der k&ouml;niglichpreussischen Kunstsammlungen 22 (1901) col. v-viii, xxviii-xxix,xlvii-xlix. Berlin: Grote, 1901.</P><P>Erman and Krebs and Sch&auml;fer &Auml;gyptische Abteilung. IN:Jahrbuch der k&ouml;niglich preussischen Kunstsammlungen 20 (1899)col. v-vi, xxiii, xxxvii-xxxviii, lxv-lxx. Berlin: Grote, 1899.</P><P>Erman and Sch&auml;fer &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preussischen Kunstsammlungen 16 (1895) col. iv-vi,xxiii, xxxv-xxxvi, liii-liv. Berlin: Grote, 1895.</P><P>Erman and Sch&auml;fer &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preussischen Kunstsammlungen 17 (1896) col. vii-viii,xxvi-xxvii, xl-xli, lxiii-lxiv. Berlin: Grote, 1896.</P><P>Gold of the pharaohs. IN: Archaeology Today 9, no. 2 (Feb 1988) p.12-14 (ill.) Frome, Somerset: Vallis House, 1988.</P><P>Grenier, Jean-Claude Religion &eacute;gyptienne dans les mondeshell&eacute;nistique et romain. IN: Annuaire: Ecole pratique deshautes &eacute;tudes: Section des sciences religieuses 102 (1993-4)p. 151-154. Paris: Ecole pratique des hautes &eacute;tudes,Section-sciences religieuses, 1994.</P><P>Grimm, G&uuml;nter Verbrannte Pharaonen? Die FeuerbestattungPtolemaios' IV. Philopator und ein gescheiterter Staatsstreich inAlexandria. IN: Antike Welt 28, no. 3 (1997) p. 233ff. 1997.</P><P>Grunert, Stefan and Joachim S. Karig. Liste der Abk&uuml;rzungenund Kurztitel in &auml;gyptologischen Publikationen (Egyptology 2)Berlin: International Association of Egyptologists, 1994.</P><P>Hallof, Jochen Mikrocomputer in der Arch&auml;ologie:Arbeitstagung Steinf&ouml;rde 1986. IN:Ethnographisch-arch&auml;ologische Zeitschrift 28 (1987) p. 161-162.Berlin: VEB Deutscher Verlag der Wissenschaften, 1987.</P><P>Hoffmann, Kay Funde im Natz: Arch&auml;ologie zum Anklicken --eine multumediale Spurensuche. 1997.</P><P>Ikram, Salima and A. Dodson Royal mummies in the Egyptian Museum.Cairo: AUC Press</P><P>Ingram, Kevin D., Kevin E. Daugherty and James L. Marshall Thepyramids: Cement or stone? IN: Journal of archaeological science 20(1993) p. 681-687 (fig.) London: 1993.</P><P>Jordan, Paul Riddles of the sphinx. ISBN 0-8147-4242-4. New YorkUniversity Press, 1998.</P><P>Junge, Friedrich Wirklichkeit und Abbild: Zuminner&auml;gyptischen Synkretismus und zur Weltsicht der Hymnen desNeuen Reiches: IN: Synkretismusforschung: Theorie und Praxis(G&ouml;ttinger Orientforschungen: Ver&ouml;ffentlichungen desSonderforschungsbereiches Orientalistik an derGeorg-August-Universit&auml;t G&ouml;ttingen. Reihe: Grundlagen undErgebnisse 1) p. 87-108. Wiesbaden: Harrassowitz, 1978.</P><P>Keel, Othmar Corpus der Stempelsiegel-Amulette ausPal&auml;stina/Israel: Von den Anf&auml;ngen bis zur Perserzeit (OBOSeries archaeologica 10) ISBN 3-7278-1005-X. Freiburg:Universit&auml;tsverlag, 1995.</P><P>Keel, Othmar Corpus der Stempelsiegel-Amulette ausPal&auml;stina/Israel: Von den Anf&auml;ngen bis zur PerserzeitKatalog Band I: Von Tell Abu Farag bis `Atlit (OBO SeriesArchaeologica 13) ISBN 3-7278-1081-5. Freiburg:Universit&auml;tsverlag, 1997.</P><P>Knigge, Carsten &#91;Review of&#93; Walker, Susan and MorrisBierbrier. Ancient faces:Mummy portraits from Roman Egypt. London:BM, 1997. IN: Antike Welt 28, no. 5 (1997) p. 451. 1997.</P><P>Knigge, Carsten &#91;Review of&#93; Bierbrier, ed. Portraits andmasks: Burial customs in Roman Egypt. IN: Antike Welt 28, no. 5(1997) p. 451. 1997.</P><P>Koenig, Yvan Les ostraca hi&eacute;ratiques inedits de laBiblioth&egrave;que Nationale et Universitaire de Strasbourg (DIFAO33) ISBN 2-7247-0210-7. Cairo: IFAO, 1997.</P><P>Kolta, Kamal Sabri Tiere und ihre kosmetische Rolle in den&auml;gyptischen und koptischen medizinischen Papyri. IN: Proceedingsof the XIXth International Congress of Papyrology I, p. 687-701.Cairo: Ain Shams University, 1992.</P><P>K&uuml;ffer, Alexandra and Marc Renfer. Das Sargensemble einervornehmen Dame aus Theban: Das Hauptobjekt der &auml;gyptischenSammlung des Bernischen Historischen Museums. IN: Antike Welt 28, no.2 (1997) p. 103ff. 1997.</P><P>Laurent, V&eacute;ronique avec la collaboration de Marc DestiAntiquit&eacute;s &eacute;gyptiennes: Inventaire des collections duMus&eacute;e des Beaux-Arts de Dijon. ISBN 2-911404-25-4. Dijon:1997.</P><P>Maran, Joseph Die Silbergef&auml;sse von et-T&ocirc;d und dieSchachtgr&auml;berzeit auf dem griechischen Festland. IN:Praehistorische Zeitschrift 62 (1987) p. 221-227 (fig.) Berlin:Walter de Gruyter, 1987.</P><P>Meskell, Lynn Intimate archaeologies: the case of Kha and Merit.IN: World Archaeology 29, no. 3 (Feb 1998) p. 363ff. London:Routledge, 1998.</P><P>Midant-Reynes, B&eacute;atrix, Pr&eacute;face de Jean Leclant.Pr&eacute;histoire de l'Egypte: Des premiers hommes aux premierspharaons. ISBN 2-220-37275-2. Paris: Armand Colin, 1992.</P><P>Molinero Polo, Miguel Angel La ambientaci&oacute;n egipcia en laCleopatra de Rider Haggard I and II. IN: Revista deArqueolog&iacute;a 152 (Dec 1993) p. 48-49 and 153 (Jan 1994) p.52-53. 1993-1994.</P><P>Molinero Polo, Miguel Angel La cartograf&iacute;a egipcia delm&aacute;s all&aacute; en los libros funerarios del Reino Medio. IN:Realidad y Mito, cap&iacute;tolo 9, p. 173ff. Madrid: EdicionesCl&aacute;sicas, 1997.</P><P>More on Egyptian priest &#91;Saite Period intact sarcophagus&#93;.IN: ANE (3 Mar 1998 11:50:58). 1998.</P><P>M&uuml;ller-Wollermann, Renate Zur Lokalisierung von Orten inMittel&auml;gypten. IN: Proceedings of the XIXth InternationalCongress of Papyrology I, p. 713-721 (map) Cairo: Ain ShamsUniversity, 1992.</P><P>Muraoka, Takamitsu and Bezalel Porten. A grammar of EgyptianAramaic. ISBN 90 04 10499 2 (Handbuch der Orientalistik I, Band 32)Leiden: Brill, 1998.</P><P>Mus&eacute;e du Louvre. L'art de l'ancien empire &eacute;gyptien:Conf&eacute;rences et colloques 3 et 4 avril 1998. Paris: Louvre,1998.</P><P>Negm, Maged The tomb of Simut called Kyky: Theban tomb 409 atQurnah. ISBN 085668 698 0. Warminster: Aris &amp; Phillips, 1997.</P><P>Ockinga, Boyo G. A tomb from the reign of Tutankhamun at Akhmim(The Australian Centre for Egyptology Reports 10) ISBN 0 85668 801 0.Warminster: Aris &amp; Phillips, 1997.</P><P>Panaino, Antonio Sirio stella-freccia nell'Oriente antico. IN:Atti della 4a Giornata di Studi Camito-Semitici e Indeuropei.Bergamo: Istituto Universitario, 29 novembre 1985, p. 139-155.Milano: Edizioni Unicopli, 1987.</P><P>Porada, Edith Remarks on Cypriote cylinders. IN: Acta Cypria: Actsof an international congress on Cypriote archaeology held inG&ouml;teborg on 22-24 August 1991, part 3 (Studies in Mediterraneanarchaeology and literature, pocket-book 120) p. 360-381 (pl.)Jonsered: Paul &Aring;str&ouml;ms F&ouml;rlag, 1992.</P><P>Rondot, Vincent La grande salle hypostyle de Karnak: Lesarchitraves. 2 volumes. Paris: &Eacute;ditions Recherche sur lesCivilisations, 1997.</P><P>Russmann, Edna R. &#91;Letter to the editor on desert kites andthe depiction of one on the Narmer palette&#93;. IN: ScientificAmerican 257, no. 5 (Nov 1987) p. 3 (fig) New York: 1987.</P><P>Rutter, Jeremy B. &#91;Review of&#93; Jordan, Paul. Riddles of thesphinx AND Davies and Friedman. Egypt uncovered. IN: History BookClub (Spring 1998) 1998.</P><P>Saite Period intact sarcophagus. IN: ANE (28 Feb 1998 20:55:15)1998.</P><P>Sch&auml;fer &Auml;gyptische Abteilung. IN: Amtliche Berichte ausden K&ouml;niglichen Kunstsammlungen IN: Jahrbuch der K&ouml;niglichpreuszischen Kunstsammlungen 25 (1904) col. x, xxvii-xviii,xlvi-xlvii, lxxxii-lxxxiii. Berlin: G. Grote'scheVerlagsbuchhandlung, 1904.</P><P>Sch&auml;fer &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preussischen Kunstsammlung 23 (1902) col. xi, xxix,lxxix-lxxx. Berlin: Grote, 1902.</P><P>Sch&auml;fer &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preuszischen Kunstsammlungen 26 (1905) col. xv,lxxxviii-lxxxix. Berlin: Grote, 1905.</P><P>Sch&auml;fer &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preuszischen Kunstsammlungen 27 (1906) col. vi-x,xxxi, lii-liii, lxxx-lxxxi. Berlin: Grote, 1906.</P><P>Sch&auml;fer &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preuszischen Kunstsammlungen 28 (1907) col. ix-x,xxxii, lx, lxxxiii-lxxxiv. Berlin: Grote, 1907.</P><P>Sch&auml;fer and Erman &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preussischen Kunstsammlung 19 (1898) col. ix-xi,xxix-xxx, xliii-xliv, lxvii-lxix. Berlin: Grote, 1898.</P><P>Sch&auml;fer and Erman &Auml;gyptische Abteilung. IN: Jahrbuch derk&ouml;niglich preussischen Kunstsammlungen 21 (1900) col. iv-vii,xxviii, xlvi, lxvi-lxx. Berlin: Grote, 1900.</P><P>Schenkel, Wolfgang Soziale Gleichheit und soziale Ungleichheit unddie &auml;gyptische Religion. IN: Vor Gott sind alle gleich, ed. byG. Kehrer, p. 26-41. D&uuml;sseldorf: 1983.</P><P>Schorsch, Deborah and James H. Frantz IN ARL A tale of twokitties. IN: MMA Bulletin 55, no. 3 (Winter 1997/98) p. 16ff. NY:MMA, 1998.</P><P>Severin, Hans-Georg Gli scavi eseguiti ad Ahnas, Bahnasa, Bawit eSaqqara: Storia delle interpretazioni e nuovi risultati. IN: Corso dicultura sull'arte Ravennate e Bizantina, p. 299-314. Ravenna:Edizioni del Girasole, 1981.</P><P>Spencer, Patricia Amara West I: The architectural report (EESm 63)ISBN 0 85698 136 2. London: EES, 1997.</P><P>Steindorff and Erman &Auml;gyptische Abteilung. IN: Jarrbuch derk&ouml;niglich preussischen Kunstsammlung 15 (1894) col. v, xvi-xvii,xxxi, xlix-l. Berlin: Grote, 1894.</P><P>Strudwick, Nigel A mortifying case of rising damp. IN: TheGeographical Magazine 60, no. 11 (Nov 1988) p. 44-48 (ill., map)London: Geographical Press, 1988.</P><P>The Electricit&eacute; de France Foundation. Egyptology: The dreamand the science &#91;ehibition&#93; January 22 - April 26, 1998:Press Packet. Paris: 1998.</P><P>Valbelle, Dominique L'&eacute;gyptologie en France aujourd'hui.IN: Livre blanc de l'orientalisme fran&ccedil;ais, p. 169-174. (map)Paris: Soci&eacute;t&eacute; asiatique, 1993.</P><P>Vandier, Jacques Trois statues &eacute;gyptiennes au Mus&eacute;edu Louvre. IN: La revue du Louvre 11 , no. 6 (1961) p. 243ff.1961.</P><P>Ward, William A new reference work on seal-amulets &#91;reviewof&#93; Keel, O. Corpus der Stempelsiegel-Amulette ausPal&auml;stina/Israel (OBO Series archaeologica 10) Freiburg:Universit&auml;tsverlag, 1995. IN: JAOS 117, no. 4 (1997) p. 673ff.1997.</P><P>Wells, Ronald Allen Astronomical detection of missing Egyptian 5thdynasty sun temples. IN: Spirit of enterprise: The 1987 Rolex awards,p. 196-198 (plan, ill.) Wokingham: Van Nostrand Reinhold, 1987.</P><P>Wiese, Andr&eacute; B. "&Auml;gypten -- Augenblicke der Ewigkeit"unbekannte Sch&auml;tze aus Schweizer Privatbesitz. IN: Antike Welt28, no. 1 (1997) p. 63ff. 1997.</P><P>Wiese, Andr&eacute; B. Das klare Licht des Orients: Die&Auml;gyptenbilder von Johann Jakob Frey in der Ausstellung"&Auml;gypten-Augenblicke der Ewigkeit" in Basel. IN: Antike Welt 28,no. 2 (1997) p. 157ff. 1997.</P><P>Wildung, Dietrich Ein folgenreicher Todesfall. IN: Antike Welt 28,no. 1 (1997) p. 27ff. 1997.</P><P>Willeitner, Joachim &Auml;gypten -- Sp&auml;tantike undChristentum am Nil: Eine Sonderausstellung zur koptischen Periode imV&ouml;lkerkundenmuseum M&uuml;nchen. IN: Antike Welt 28, no. 2(1997) p. 153ff. 1997.</P><P>Willeitner, Joachim Nubien: Antike Monumente zwischen Assuan undKhartoum. ISBN 3-7774-7500-9. Munich: Hirmer Verlag, 1997.</P><P>Wiseman, James The death of innocents: A Postmortem on the terrorat the temple of Hatshepsut. IN: Archaeology 51, no. 2 (Mar/Apr,1998) p. 10ff. Boston: AIA, 1998.</P><P>Zbikowski, D&ouml;rte Inspirationsquelle Alt-&Auml;gypten: ZurAusstellung "Paul Klee -- Reisen in den S&uuml;den" in Leipzig. IN:Antike Welt 28, no. 3 (1997) p. 266ff. 1997.</P><P>Zimhoni, Orna Studies in the iron age pottery of Israel:Typological, archaeological and chronological aspects (Tel AvivOccasional Publications 2) ISBN 965-266-010-8. Tel Aviv University,Institute of Archaeology, 1997.</P><P>&nbsp;</P><P></P></BODY></HTML>