<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd"><html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<title>Wilbour accessions April 97</title>	</head>	<body>		<h1>Wilbour accessions list April 1997</h1>		<p>Antikenmuseum Basel und Sammlung Ludwig. &Auml;gypten: Augenblicke der Ewigkeit: unbekannte Sch&auml;tze aus Schweizer Privatbesitz: 18. M&auml;rz - 13. Juli 1997. Basel: Antikenmuseum, 1997.</p>		<p>Behrmann, Almuth, Heinz Felber and Dieter Kurth Der Schrein des Inaros, Sohn des Peteisis. IN: Mitteilungen aus dem Museum f&uuml;r V&ouml;lkerkunde, Hamburg 17 (1987) p. 159-200 (fig., ill.) Hamburg: 1987.</p>		<p>Beltz, Walter und Markus Mode, eds. Spurensuche in der Vorderasienarch&auml;ologie (Hallesche Beitr&auml;ge zur Orientwissenschaft 21) Halle (Saale): Martin-Luther-Universit&auml;t Halle-Wittenberg, 1996.</p>		<p>Bolshakov, Andrey O. Man and his double in Egyptian ideology of the Old Kingdom (&Auml;AT 37) ISBN 3-447-03892-6. Wiesbaden: Harrassowitz, 1997.</p>		<p>Brashear, William A propos des tablettes magiques. IN: Lalou, E., ed. Les tablettes &agrave; &eacute;crire de l'antiquit&eacute; &agrave; l'&eacute;poque moderne (Bibliologia: Elementa ad librorum studia pertinentia 12) Turnhout: Brepols, 1992.</p>		<p>Brashear, Wm., ed. The archive of Athenodorus (and assorted from Augustan Egypt) (&Auml;gyptische Urkunden aus dem Staatlichen Museen Berlin, Preussischer Kulturbesitz : Griechische Urkunden 16) ISBN 3-88609-392-1. Berlin: Staatliche Museen zu Berlin-Preussuscher Kulturbesitz, 1995.</p>		<p>Brunner-Traut, Emma Atl&auml;gyptische M&auml;rchen: Mythen und andere volkst&uuml;mliche Erz&auml;hlungen. ISBN 3-424-01011-1. M&uuml;nchen: Eugen Diederichs, 1997.</p>		<p>Bruyn, M.J. de The battle of Qadesh: Some reconsiderations. IN: To the Euphrates and beyond: Archaeological studies in honour of Maurits N. van Loon, p. 135ff. Rotterdam: A.A. Balkema, 1989.</p>		<p>Cenival, Jean-Louis de Les tablettes &agrave; &eacute;crire dans l'&Eacute;gypte pharaonique. IN: Lalou, &Eacute;lisabeth, ed. Les tablettes a &eacute;crire de l'antiquit&eacute; &agrave; l'&eacute;poque moderne (Bibliologia: Elementa ad Librorum Studia Pertinentia 12) p. 35-40. Turnhout: Brepols, 1992.</p>		<p>Chadwick, Robert Goddesses, queens, and housewives: Women in ancient Egypt and Mesopotamia: Introductory remarks. IN: The Canadian society for Mesopotamian Studies Bulletin (Nov 1993) p. 5-6. Toronto: The Society, 1993.</p>		<p>Chelenko, Theodore, curator Egypt in Africa [exhibition] Indianapolis Museum if Art. ISBN 0-936260-64-5. Indianapolis: Museum of Art, 1996.</p>		<p>Courtois, Jacques-Claude and Jennifer M. Webb KEV N399.5 C99 C83 Les cylindres-sceaux d'Enkomie (fouilles fran&ccedil;aise 1957-1970) ISBN 9963-7654-0-8, nos. 22-27. Nicosia: American Archaeological Research Institute, 1987.</p>		<p>Durand, Agn&egrave;s L'&Eacute;gypte romaine. IN: Arch&eacute;ologia 333 (Apr 1997) p. 18ff. 1997.</p>		<p>Edel, Elmar KBo I 15+19, ein, ein Brief Ramses' II. mit einer Schilderung der Kadesschlacht. IN: Zeitschrift f&uuml;r Assyriologie und vorderasiatische Arch&auml;ologie 15 (49) (1950) p. 195ff. Berlin: Walter de Gruyter, 1950.</p>		<p>Fazzini, Richard A. Mistress of the house, mistress of heaven: Women in ancient Egypt. IN: NARCE 172 (Mar 1997) p. 2ff. NY: ARCE, 1997.</p>		<p>Germer, Renate Mummies: life after death in ancient Egypt [exhibition] Museum f&uuml;r Kunst und Gewerbe, Hamburg and in the Roemer- und Pelizaeus Museum, Hildesheim. Munich: Prestel-Verlag, 1997.</p>		<p>Goelet, Ogden, Jr. A new 'robbery' papyrus: Rochester MAG 51.346.1. IN: JEA 82 (1996) p. 107ff. London: EES, 1996.</p>		<p>Hasitzka, M.R.M. Neue Texte und Dokumentation zum Koptish-Unterricht (Papyrus Erzherzog Rainer) (Mitteilungen aus der Papyrussammlung der &Ouml;sterreichischen Nationalbibliothek, Neue Serie 18) Vienna: Hollinek, 1990.</p>		<p>Karenga, Maulana Ndabezitha Maat: the moral ideal in ancient Egypt. Dissertation. University of Southern California (1994) Ann Arbor: UMI, 1997.</p>		<p>Khalil, Fr. Marcos Aziz Coptic orthodox Church from St. Mark...to...Pope Shenouda III. Anba Reuis Press</p>		<p>Killen, Geoffrey IN ARL The style and development of ancient Egyptian furniture, part I. IN: The Magazine Antiques (April 1997) p. 574ff. NY: Brant Publications, 1997.</p>		<p>Koenig, Viviane The Ancient Egyptians: life in the Nile Valley (Peoples of the past) ISBN 1-56294-161-5. Brookfield, CT: Millbrook Press, 1992.</p>		<p>Krauspe, Renate Statuen und Statuetten (Katalog &Auml;gyptischer Sammlungen in Leipzig 1) ISBN 3-8053-1883-9. Mainz: Zabern, 1997.</p>		<p>Lawergren, Bo Leiern. IN: Die Musik in Geschichte und Gegenwart: Allgemeine Enzyklop&auml;die der Musik, zweite, neubearbeitete Ausgabe, v. 5, col. 1011ff. Kassel: B&auml;renreiter</p>		<p>Lawergren, Bo Counting strings on ancient Egyptian chordophones: On the thin and thick types of lyres, the unreliability of string representations, the definition of paucichords and multichords, and the significance of angular harps. IN: La plurdisciplinarit&eacute; en arch&eacute;ologie musicale: IVe rencontre internationales d'arch&eacute;ologie musicale de l'ICTM, Saint-Germain-en-Kaye, 8-12 octobre 1990, p. 521ff. 1990.</p>		<p>Lawergren, Bo Lyres in the west (Italy, Greece) and east (Egypt, the Near East), ca. 2000 to 400 B.C. IN: Opuscula Romana 19, no. 6 (1993) p. 55ff. 1993.</p>		<p>Lawergren, Bo The spread of harps between the near and far east during the first millennium A.D. IN: Silk road art and archaeology 4 (1995/6) p. 233ff. Amakura: Journal of the Institute of Silk Road Studies, 1996.</p>		<p>Lawergren, Bo Harfen (antike). IN: Die Musik in Geschichte und Gegenwart: Allgemeine Enzyklop&auml;die der Musik, zweite, neubearbeitete Ausgabe, v. 4, col. 39ff. Kassel: B&auml;renreiter</p>		<p>Leitz, Christian Studien zur &auml;gyptischen Astronomie 2., verbesserte Auflage (&Auml;gyptologische Abhandlungen 49) ISBN 3-447-03157-3. Wiesbaden: Harrassowitz, 1991.</p>		<p>Martin, Thomas R. [Review of] Turcan, Robert. The cults of the Roman empire. Blackwell. IN: History Book Club</p>		<p>Mathieu, Bernard La po&eacute;sie amoureuse de l'Egypte ancienne: Recherches sur un genre litt&eacute;raire au Nouvel Empire (BdE 115) ISBN 2-7247-0182-8. Cairo: IFAO, 1997.</p>		<p>McDonald, John K. House of eternity: The tomb of Nefertari. ISBN 0892364157. Los Angeles: Getty Conservation Institute and J. Paul Getty Museum, 1996.</p>		<p>Murray, Barbara Jean Ceramic production in predynastic Egypt: A Preliminary reassessment of a predynastic industry. Hunter College, 1994. Ann Arbor: UMI, 1997.</p>		<p>Mus&eacute;e d'Arch&eacute;ologie M&eacute;diterran&eacute;enne, Marseille. La collection &eacute;gyptienne: Guide du visiteur. ISBN 2-901402-43-7. Marseille: Mus&eacute;es de Marseille/Mus&eacute;e d'Arch&eacute;olofie M&eacute;diterran&eacute;enne, ca. 1997.</p>		<p>Museum of Fine Arts, Boston. Meet the kings and queens of Nubia: A Looking guide to be used in the gallery by children and adults, together. Boston: MFA, [ca. 1996]</p>		<p>Nielsen, Anne Marie and Jan Stubbe Ostergaard. Catalogue: The Eastern Mediterranean in the Hellenistic period. ISBN 87 7452 218 3. Copenhagen: Ny Carlsberg Glyptotek, 1997.</p>		<p>Niwinski, Andrej Coffins from the tomb of Iurudef: A Reconsideration: The problem of some crude coffins from the Memphite area and Middle Egypt [review article] Raven, M.J. The tomb of Iurudef a Mamphite official in the reign of Ramesses II (EESm 57) London: EES, 1991. IN: BiOr 63 (1996) col. 324ff. Leiden: 1996.</p>		<p>Niwinski, Andrzej Ritual protection of the dead or symbolic reflection of his special status in society? The problem of the black-coated cartonnages and coffins of the Third Intermediate Period. IN: Studia Aegyptiaca 14 (1992) p. 457ff. Budapest: 1992.</p>		<p>Niwinski, Andrzej La seconde trouvaille de Deir el-Bahari (Sarcophages) Tome 1, facs. 2 (Catalogue g&eacute;n&eacute;ral des antiquit&eacute;s &eacute;gyptiennes du Mus&eacute;e du Caire, nos. 6029-6068) Cairo: 1996.</p>		<p>Posener-Krieger, Paule Les tablettes en terre crue de Balat. IN: Lalou, E., ed. Les tablettes &agrave; &eacute;crire de l'antiquit&eacute; &agrave; l'&eacute;poque moderne (Bibliologia: Elementa ad librorum studia pertinentia 12) Turnhout: Brepols, 1992.</p>		<p>Ray, Sudhansu Kumar Prehistoric India and ancient Egypt. New Delhi: Cambridge Book and Stationary Store, 1956.</p>		<p>Regner, Christina Schminkpaletten (Bonner Sammlung von Aegyptiaca 2) ISBN 3-447-03812-8. Wiesbaden: Harrassowitz, 1996.</p>		<p>Vartavan, Christian de Analyse plurisyst&eacute;matique pour l'interpr&eacute;tation des restes v&eacute;g&eacute;taux de la tombe de Toutankhamon. IN: Annales de la Fondation Fyssen 8 (1993) p. 9ff. Paris: Fondation Fyssen, 1993.</p>		<p>Weidner, Anke G. Koptische Kopfbedeckungen in Sprangtechnik: Eine seltene Gruppe von Textilien in den Sammlungen des Germanischen Nationalmuseums N&uuml;rnberg. IN: Restauro 3 (1996) p. 184ff. 1996.</p>		<p>Werner, Friederike &Auml;gyptenrezeption in der europ&auml;ischen Architektur des 19. Jahrhunderts. ISBN 392974242X. Weimar: VDG Verlag, 1994.</p>		<p>Willingham, Bess The lady's mummy [fiction]. ISBN 0-8217-5545-5. NY: Kennsington Publishing Corp., 1997.</p>		<p>Soudan: Royaumes sur le Nil Paris: Paris Match and Institut du Monde Arabe, 1997.</p>		<p>Coptic orthodox monastery of St. Antony the Great, Red Sea - Egypt.</p>		<p>Coptic icons (Orbis terrae Aegyptiae) ISBN 977-481020-1. Cairo: Lehnert &amp; Landrock, 1986.</p>		<p>Coptic orthodox monastery of St. Paul, Red Sea-Egypt.</p>		<p>Coptic art, 2 volumes. ISBN 977-243-000-2. Cairo: Lehnert &amp; Landrock</p>		<p>Cahiers de Karnak X (1995) ISBN 2-86538-250-8. Paris &Eacute;ditions Recherche sur les Civilisations, 1995.</p>		<p>Le mastaba d'Akhethetep mis au jour par le Louvre. IN: Arch&eacute;ologia 333 (Apr 1997) p. 7. 1997.</p>	</body></html>