<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><!-- This document was created from RTF source by rtftohtml version
2.7.5 -->
<title>Wilbour Feb 1996</title>
</head>

<body>
<center>

<h1>Wilbour Library</h1>
<h2>Recent Acquisitions</h2>
<h3>February 1996</h3>
 
</center>

Assam, Maria Helena Arte egipcia: Collec&ccedil;ao Calouste Gulbenkian, Lisboa,
Museu Calouste Gulbenkian - Funda&ccedil;ao Calouste Gulbenkian. Museu Calouste
Gulbenkian, 1991.<p>
Athens. National Archaeological Museum. The world of Egypt in the National
Archaeological Museum. ISBN 960-7254-16-3. Athens: Greek Ministry of Culture,
1995.<p>
Bienkowski, Piotr and Angela M.J. Tooley. Gifts of the Nile. ISBN 0 11 290538
2. London: HMSO Bookshop, 1995.<p>
Bierbrier, M.L., ed. Who was who in Egyptology. 3rd. ed. London: EES, 1995.<p>
Bongioanni, Alessandro e Riccardo Grazzi Torino, l'Egitto e l'Oriente fra
storia e leggenda (Collane Le Radice) ISBN 88-86142-08-0. Torino: Libreria
L'Angelo Manzoni Editrice, 1994.<p>
Brooklyn Museum The story of Methethy. Brooklyn: Brooklyn Museum, 1978.<p>
Cleveland Museum of Art Pharaohs: Treasures of Egyptian art from the Louvre
[exhibition catalog]     ISBN 0-940717-32-8. Cleveland: Museum of Art, 1996.<p>
Cooney, John D. Some late Egyptian antiquities.  IN:  CMA Bulletin 62, no. 7
(Sept 1975) p. 229ff. Cleveland: CMA, 1975.<p>
Davies, Vivian Recent acquisitions: Egyptian antiquities.  IN:  British Museum
Magazine 14 (1993) p. 28-29. London: BM, 1993.<p>
Desroches-Noblecourt, Christiane La grande Nubiade: Le parcours d'une
&eacute;gyptologue. ISBN 2-234.02409.9. Paris: Stock/Pernoud, 1992.<p>
Desroches-Noblecourt, Christiane Amours et fureurs de la Lointaine: Cl&eacute;s
pour la compr&eacute;hension de symboles &eacute;gyptiens. Paris:
Stock/Pernoud, 1995.<p>
Drury, Allen Return to Thebes. ISBN 0-385-049199-3. Garden City: Doubleday,
1977.<p>
Filer, Joyce Disease (Egyptian bookshelf) ISBN 0 7141 0980 0. London: British
Museum Press, 1995.<p>
Fluck, C&auml;cilia et al., eds. Divitiae Aegypti: Koptologische und verwandte
Studien zu Ehren von Martin Krause. ISBN 3-88226-835-2. Wiesbaden: Reichert,
1995.<p>
Garcia Moreno, L.A. and A. P&eacute;rez Largacha, A., eds. De Narmer a Ciro
(3150 a.C.-642 d.C.) (Aegyptiaca Complutensia 1) ISBN 84-86981-64-6. Alcala de
Henares: Universidad de Alcala de Henares, 1991.<p>
Gardner, Milo Egyptian grammar and Egyptian fractions.  IN:  ANE (29 Jan 1996
12:24:22) Chicago: Oriental Institute, 1996.<p>
Gedge, Pauline The twelfth transforming. ISBN 0-06-015338-5. New York: Harper
Collins, 1984.<p>
Higgins, Chester Feeling the spirit. ISBN 0-553-09556-0. New York: Bantam
Books, 1994.<p>
Illig, Heribert and F. L&ouml;hner Der Bau der Cheopspyramide: Seilrollen an
der Pyramidenflanke- oder wie die Pharaonen wirklich bauten. Gr&auml;felfing:
Mantis Verlag, 1994.<p>
Jones, Dilwyn Boats (Egyptian bookshelf) ISBN 0 7141 0975 4. London: British
Museum Press, 1995.<p>
Jorgensen, Mogens Gemnis grav.  IN:  Meddelelser fra Ny Carlsberg Glyptotek 51
(1995) p. 110ff. Kobenhavn: 1995.<p>
Kanawati, Naguib Akhmim in the Old Kingdom. Part 1: Chronology and
administration (The Australian Centre for Egyptology studies 2) ISBN
0-85837-791-8. Sydney: Australian Centre for Egyptology, 1992.<p>
Kozloff, Arielle P. Ancient art.  IN:  CMA Bulletin 62, no. 6 (June 1975) p.
179. Cleveland: CMA, 1975.<p>
Lythgoe, A.M. The Egyptian expedition.  IN:  BMMA 2, no. 4 (Apr 1907) p. 60ff.
NY: MMA, 1907.<p>
Lythgoe, A.M. Graeco-Egyptian portraits.  IN:  BMMA 5, no. 3 (March 1910) p.
67ff. NY: MMA, 1910.<p>
Lythgoe, A.M. Egyptian expedition III.  IN:  BMMA 2, no. 10 (Oct 1907) p.
163ff. NY: MMA, 1907.<p>
Lythgoe, A.M. The Egyptian expedition II.  IN:  BMMA 2, no. 7 (July 1907) p.
113ff. NY: MMA, 1907.<p>
Lythoge, A. M. Recent Egyptian acquisitions.  IN:  BMMA 2, no. 12 (Dec 1907) p.
193ff. NY: MMA, 1907.<p>
Lythoge, A.M. The Egyptian Expedition.  IN:  BMMA 4, no. 7 (July 1909) p.
119ff. NY: MMA, 1909.<p>
Metropolitan Museum of Art. Department of Egyptian art.  IN:  BMMA 1, no. 12
(Nov 1906) p. 149ff. NY: MMA, 1906.<p>
Nielsen, Anne Marie Om ptolemaeiske dronninger og gudinder.  IN:  Meddelelser
fra Ny Carlsberg Glyptotek 51 (1995) p. 94ff. Kobenhavn: 1995.<p>
O'Connor, David     IN ARL Jaroslav Cerny.  IN:  Expedition 12, no. 4 (Summer
1970) p. 2ff. Philadelphia: University of Pennsylvania, 1970.<p>
Orel, Sara Kamose and Ahmose.  IN:  ANE (4 Feb 1996 00:49:47) Chicago: Oriental
Institute, 1996.<p>
Orthmann, Winfried Zum Relief Nr. 81 in Yazilikaya. IN: Beitr&auml;ge zur
Altertumskunde Kleinasiens. Festschrift f&uuml;r Kurt Bittel, p. 427-431. (pl.)
Mainz: Zabern, 1983.<p>
P&eacute;rez Largacha, Antonio Los &uacute;ltimos a&ntilde;os del
per&iacute;odo amarniense.  IN:  Espacio, tiempo y forma II, 7 (1994) p. 41ff.
Madrid: 1994.<p>
P&eacute;rez Largacha, Antonio Egipto y Sirio-Palestina en &eacute;poca de
Tutmosis III.  IN: Bolet&iacute;n de la Asociaci&oacute;n Espa&ntilde;ola de
Orientalistas 23 (1987) p. 317-332. Madrid: 1987.<p>
P&eacute;rez Largacha, Antonio Chiefs and protodynastic Egypt: A Hydraulic
relation?  IN: Arch&eacute;o-Nil 5 (Mai 1995) p. 79ff. 1995.<p>
Perez Largacha, Antonio Condicionantes ecologicos en la formacion del estado en
Egipto.  IN:  Bolet&iacute;n de la Asociaci&oacute;n Espa&ntilde;ola de
Orientalistas 29 (1993) p. 189ff. Madrid: 1993.<p>
P&eacute;rez Largacha, Antonio Some suggestions and hypotheses concerning the
Maadi culture and the expansion of upper Egypt.  IN:  GM 135 (1993) p. 41ff.
1993.<p>
P&eacute;rez Largacha, Antonio Ejercito y estado en el antiguo Egipto.  IN:
Bolet&iacute;n de la Asociaci&oacute;n Espa&ntilde;ola de Orientalistas 30
(1994) p. 59ff. Madrid: 1994.<p>
P&eacute;rez Largacha, Antonio Akhenaton. Pacifismo religioso?  IN:  Espacio,
tiempo y forma II, 7 (1994) p. 363ff. Madrid: 1994.<p>
P&eacute;rez Largacha, Antonio Relations between Egypt and Mesopotamia at the
end of the fourth millennium.  IN:  GM 137 (1993) p. 59ff. 1993.<p>
Perez Largacha, Antonio Some reflections on trade relations between Egypt and
Palestine (IV-III Millenia).  IN:  GM 145 (1995) p. 83ff. 1995.<p>
Pretty, G.     IN ARL The Maclean Museum mummy from Torres Straits: A
Postscript to G. Eliot Smith and the diffusion controversy.  IN:  Man 4 (1969)
p. 24-43. 1969.<p>
Ransom, C.L. A commemorative scarab of Thutmose III.  IN:  BMMA 10, no. 3
(March 1915) p. 46-47. NY: MMA, 1915.<p>
Reel, Monte Life after the tomb [Kent Weeks and KV5].  IN:  Egypt today 16, no.
11 (Nov 1995) p. 94ff. 1995.<p>
Rohl, David Pharaohs and kings: A Biblical quest. Originally published in the
United Kingdom and the rest of the world as A test of time: The Bible from myth
to history. ISBN 0-517-70315-7. New York: Crown, 1995.<p>
S&auml;ve-S&ouml;derbergh, Torgny, directeur de la publication Victoire en
Nubie: Le campagne internationale de sauvegarde d'Abou Simbel, de Philae et
d'autres tr&eacute;sors culturels. ISBN 9232023830. Paris: Organisation des
Nations Unies, 1992.<p>
Skeat, Theodore Cressy The reign of Augustus in Egypt: Conversion tables for
the Egyptian and Julian calendars, 30 B.C. -14 A.D. (M&uuml;nchener
Beitr&auml;ge zur Papyrusforschung und Antiken Rechtsgeschichte 84) 9SBN
3406-37384-4. Munich: Beck, 1993.<p>
Slater, Ray Anita     IN ARL Dendereh and the University Museum 1898-1970.  IN:
Expedition 12, no. 4 (Summer 1970) p. 15ff. Philadelphia: University Museum,
1970.<p>
Smart, Ninian The religious experience. 5th ed. ISBN 0-02-412141-X. Upper
Saddle River, NJ: Prentice Hall, 1996.<p>
Steedman, Scott Ancient Egypt (Pockets) ISBN 0-7894-0216-5. London: Dorling
Kindersley, 1995.<p>
Strouhal, E. Rassengeschichte Aegyptens.  IN:  Rassengeschichte der Menschheit
3 (1975) p. 8-89. Munich: Oldenberg, 1975.<p>
Strouhal, Eugen Evidence of the early penetration of Negroes into prehistoric
Egypt.  IN:  Journal of African history 12 (1971) p. 1-9. 1971.<p>
Teeter, Emily Medinet Habu award.  IN:  ANE (8 Feb 1996 13:17:28) Chicago:
Oriental Institute, 1996.<p>
Tenger, Bernhard Die Verschuldung im r&ouml;mischen &Auml;gypten (1.-2. Jh. n.
Chr.) (Pharos: Studien zur griechisch-r&ouml;mischen Antike 3) ISBN
3-928134-79-5. St. Katherinen: Scripta Mercaturae Verlag, 1993.<p>
Tubb, Kathryn Walker Antiquities: Trade or betrayed. ISBN 1 873132 700. London:
Archetype Books, 1995.<p>
Tyldesley, Joyce Daughters of Isis: Women of ancient Egypt. ISBN 0-670-84838-7.
London: Viking, 1994.<p>
Van Gerven, D.P. et al.     IN ARL Racial history and biocultural adaptation of
Nubian archaeological populations.  IN:  Journal of African history 14 (1973)
p. 555-564. 1973.<p>
Wiener, Malcolm H. Trade and rule in palatial Crete.  IN:  The function of the
Minoan palaces, p. 261-268. Stockholm: Svenska Institutet i Athen, 1987.<p>
Yoyotte, Jean Le&ccedil;on inaugurale faite le Vendredi 27 mars 1992. ISBN
2-7226-0003-X. Paris: Coll&egrave;ge de France, 1992.<p>
Zach, Michael Meroe: Mythos und Realit&auml;t einer Frauenherrschaft im antiken
Afrika.  IN:  Nachrichten aus der Zeit, p. 73-114, Abb. Wien: 1992.<p>
Zach, Michael Die Frau im meroitischen Wirtschaftsleben.  IN: Frauenreichtum:
Die Frau als Wirtschaftsfaktor im Altertum (Reihe Frauenforschung 27) p. 73ff.
Wien: Wiener Frauenverlag, 1994.<p>
  Les pharaons soleil (L'Express suppl&eacute;ment) (29 avril 1993) 1993.<p>
  Les divinit&eacute;s de l'Egypte ancienne (III-VI) (Fiche suppl&eacute;ment
du no. 320 d'arch&eacute;ologia) 1996.<p>
<p>
</body></html>
